In [9]:
import pandas as pd

In [10]:
data = pd.Series([13,14,15])
data

0    13
1    14
2    15
dtype: int64

In [11]:
data = pd.DataFrame ({
    'Name' : ['Shreeram','Riya','Ram'],
    'Age': [21,22,23],
    'City':['Vithalwa','Kalyan', 'Pune']
    })
df = pd.DataFrame(data)
df

       Name  Age      City
0  Shreeram   21  Vithalwa
1      Riya   22    Kalyan
2       Ram   23      Pune

In [12]:
df = pd.read_csv('employees.csv')
df.head(3)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,21-JUN-07,SH_CLERK,2600,-,124,50
1,199,Douglas,Grant,DGRANT,650.507.9844,13-JAN-08,SH_CLERK,2600,-,124,50
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,17-SEP-03,AD_ASST,4400,-,101,10

In [13]:
df.columns

Index(['EMPLOYEE_ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER',
       'HIRE_DATE', 'JOB_ID', 'SALARY', 'COMMISSION_PCT', 'MANAGER_ID',
       'DEPARTMENT_ID'],
      dtype='str')

In [14]:
df.isna().sum()

EMPLOYEE_ID       0
FIRST_NAME        0
LAST_NAME         0
EMAIL             0
PHONE_NUMBER      0
HIRE_DATE         0
JOB_ID            0
SALARY            0
COMMISSION_PCT    0
MANAGER_ID        0
DEPARTMENT_ID     0
dtype: int64

In [17]:
data = {
    "Department": ["IT", "HR", "IT", "Finance", "HR", "IT"],
    "Salary": [50000, 40000, 60000, 45000, 42000, 70000],
    "Experience": [2, 3, 5, 4, 2, 6]
}

df = pd.DataFrame(data)

# 1. Find average salary of each department
# 2. Find highest salary
# 3. Filter employees with experience > 3
# 4. Sort salary descending